
&НаСервере
Функция ПолучитьЦенуТовара(Знач Номенклатура)
	
	Цена = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	                |ИЗ
	                |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Цена = ВыборкаДетальныеЗаписи.Цена;
	Возврат Цена;  
КонецФункции
 
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент) 
	ТекущиеДанныеТовара = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТовара.Сумма = ТекущиеДанныеТовара.Количество * ТекущиеДанныеТовара.Цена; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанныеТовара = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТовара.Сумма = ТекущиеДанныеТовара.Количество * ТекущиеДанныеТовара.Цена; 
КонецПроцедуры

&НаСервере
Процедура ЦенаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте                                            
Процедура Цена(Команда)
	ЦенаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Цена = ПолучитьЦенуТовара(Элементы.Товары.ТекущиеДанные.Товар);
КонецПроцедуры
